#include <iostream>

using namespace std;

// Ініціалізація змінної, що міститиме натуральне число
int number; 

// Функція для знаходження кількості дільників даного числа
int divisors(int n) {
    
  int count = 0; // Змінна, що містить кількість дільників
  
  // Цикл, що ділить кожне число, яке меньше або дорівнює n
  for (int i = 1; i <= n; i++) {
    // Перевірка ділення націло на i числа n
    if (n % i == 0) {
      count++; // Якщо число ділиться, то додаємо 1 до кількості дільників
    }
  }
  return count; // Вертаємо кількість дільників з функції
}

int main() {

  cout << "Введіть натуральне число" << endl; // Виведення у консоль речення
  cin >> number; // Введення натурального числа з консолі
  if (cin.fail()) { // Перевірка введеного значення
      cout << "Помилка! Перезапустіть програму на введіть натуральне число" << endl; // Повідомлення про неправильне введення
      exit(0); // Зупинення виконання програми
  }
  int count = divisors(number); // Виклик функції divisors()

  cout << "Кількість дільників числа - " << count << endl; // Виведення кількості дільників

  return 0;
}